/* The title of the button for aborting the scanning of Audio Units. */
"Abort" = "Henti Paksa";

/* alert button
   dialog confirmation */
"OK" = "OK";

/* alert button */
"Abort scan" = "Henti paksa imbasan";

/* alert button */
"Continue" = "Teruskan";

/* alert button */
"Continue scan" = "Teruskan imbasan";

/* alert button */
"Ignore" = "Abaikan";

/* alert button */
"Ignore plug-in" = "Abaikan plugin";

/* alert button */
"Open plug-in graphic interface" = "Buka antara muka grafik plugin";

/* alert button */
"Start Plug-In Manager" = "Mulakan Pengurus Plugin";

/* alert text */
"Dear ^P user,\nyou have %ld Audio Unit(s) enabled which did not pass the Apple AU validation. This may cause problems and can even crash ^P or lead to data loss! Please check with the manufacturer(s) for updated versions. We recommend disabling these plug-ins in the Plug-In Manager." = "Pengguna ^P yang dihormati,\nanda telah mendayakan %ld Audio Unit yang tidak lulus pengesahan Apple AU. Ini mungkin menyebabkan masalah dan boleh menyebabkan ^P tergendala anda menyebabkan kehilangan data! Sila semak dengan pengeluar untuk mendapatkan versi yang dikemas kini. Kami syorkan anda menyahdayakan plugin ini dalam Pengurus Plugin.";

/* alert text */
"Only Audio Units that have been successfully scanned will be available in ^P.\nScanning will continue next time you launch ^P." = "Hanya Audio Units yang berjaya diimbas akan tersedia dalam ^P.\nPengimbasan akan diteruskan pada kali seterusnya anda melancarkan ^P.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection." = "Unit Audio “%1$@” oleh “%2$@” melaporkan bahawa ia tidak dibenarkan dengan sempurna untuk digunakan pada sistem ini.\nSila semak dokumentasi pemalam untuk mendapatkan maklumat lanjut tentang perlindungan salinannya.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection. You may open the plug-in’s graphic interface now for managing copy protection." = "Unit Audio “%1$@” oleh “%2$@” melaporkan bahawa ia tidak dibenarkan dengan sempurna untuk digunakan pada sistem ini.\nSila semak dokumentasi pemalam untuk mendapatkan maklumat lanjut tentang perlindungan salinannya. Anda boleh membuka antara muka grafik pemalam sekarang untuk menguruskan perlindungan salinan.";

/* alert text */
"While verifying Audio Unit compatibility, ^P encountered %ld Audio Unit plug-in(s) which did not pass the Apple AU validation. These plug-ins have been excluded from further usage in ^P to prevent possible problems or crashes. You can start the Plug-In Manager now to review the validation results or continue the startup process." = "Dengan mengesahkan keserasian Audio Unit, ^P menghadapi %ld plugin Audio Unit yang tidak lulus pengesahan Apple AU. Plugin ini telah dikecualikan daripada penggunaan lanjut dalam ^P untuk mengelakkan kemungkinan masalah atau kegendalaan. Anda boleh memulakan Pengurus Plugin sekarang untuk menyemak keputusan pengesahan atau meneruskan proses permulaan.";

/* alert text */
"^P unexpectedly quit while trying to use the Audio Unit “%@” by “%@”.\nThis plug-in may require an update." = "^P telah keluar diluar jangkaan semasa cuba menggunakan Audio Unit “%1$@” oleh “%2$@”.\nPemalam ini mungkin memerlukan kemas kini.";

/* alert title */
"An error has occurred with an installed Audio Unit plug-in." = "Ralat telah berlaku dengan plugin Audio Unit yang dipasang.";

/* alert title */
"Audio Unit authorization error." = "Ralat pengesahan Audio Unit.";

/* alert title */
"Incompatible Audio Units found." = "Audio Units tidak serasi ditemui.";

/* alert title */
"You are about to abort the scan process." = "Anda akan menghenti paksa proses imbasan.";

/* alert title */
"You are using incompatible Audio Units." = "Anda menggunakan Audio Units tidak serasi.";

/* audio unit type */
"MIDI processor" = "Pemproses MIDI";

/* audio unit type */
"MIDI-controlled effect" = "Kesan dikawal MIDI";

/* audio unit type */
"effect" = "kesan";

/* audio unit type */
"format converter" = "penukar format";

/* audio unit type */
"generator" = "penjana";

/* audio unit type */
"instrument" = "instrumen";

/* audio unit type */
"mixer" = "pencampur";

/* audio unit type */
"offline effect" = "kesan luar talian";

/* audio unit type */
"output unit" = "unit output";

/* audio unit type */
"panner" = "penyorot";

/* message while starting up */
"Searching for Audio Unit plug-ins…" = "Mencari plugin Audio Unit…";

/* message while starting up */
"Updating information about Audio Unit plug-ins…" = "Mengemas kini maklumat tentang pemalam Audio Unit…";

/* possible validation result */
"couldn’t be opened" = "tidak dapat dibuka";

/* possible validation result */
"crashed validation" = "pengesahan tergendala";

/* possible validation result */
"failed validation" = "pengesahan gagal";

/* possible validation result */
"not authorized" = "tidak dibenarkan";

/* possible validation result */
"not validated due to internal error" = "tidak disahkan disebabkan ralat dalaman";

/* possible validation result */
"not yet validated" = "belum disahkan lagi";

/* possible validation result */
"successfully validated" = "berjaya disahkan";

/* progress dialog text */
"Scanning Audio Units (finalized %d of %d)" = "Mengimbas Audio Units (%1$d daripada %2$d dimuktamadkan)";

/* progress dialog text */
"Scanning Audio Units (finalized %ld of %ld)" = "Mengimbas Audio Units (%1$ld daripada %2$ld dimuktamadkan)";

/* used for invalid version numbers */
"invalid" = "tidak sah";

/* used when value transformer can’t interpret given object */
"unknown" = "tidak diketahui";
